import '../models/planet.dart';

final List<Planet> planets = [
  Planet(
    name: 'الشمس',
    description:
        'الشمس هي النجم المركزي للنظام الشمسي، وتعتبر أكبر جسم فيه، حيث تمثل أكثر من 99٪ من كتلته الكلية. تُصدر الشمس الضوء والطاقة من خلال تفاعلات نووية هائلة تحدث في نواتها، وهي السبب الرئيسي وراء الحياة على الأرض من خلال توفير الحرارة اللازمة للحفاظ على درجة حرارة معتدلة ومناسبة.',
    imagePath: 'assets/img/sun.gif',
  ),
  Planet(
    name: 'عطارد',
    description:
        'عطارد هو أصغر كوكب في النظام الشمسي وأقرب كوكب إلى الشمس. يتميز عطارد بسطح مليء بالحفر الناتجة عن اصطدامات النيازك، ويفتقر إلى الغلاف الجوي الكثيف، مما يجعله يتعرض لتغيرات هائلة في درجات الحرارة بين الليل والنهار. يمكن رؤية عطارد من الأرض كنقطة لامعة عند الفجر أو الغروب.',
    imagePath: 'assets/img/mercury.gif',
  ),
  Planet(
    name: 'الزهرة',
    description:
        'الزهرة، المعروف أيضًا باسم "نجمة الصباح" و"نجمة المساء"، هو الكوكب الثاني من حيث البعد عن الشمس. يتميز الزهرة بجو كثيف مليء بثاني أكسيد الكربون، مما يؤدي إلى تأثير دفيئة قوي يجعله الكوكب الأكثر سخونة في النظام الشمسي. سطحه مغطى بسحب سميكة من حمض الكبريتيك، ما يجعله غير مرئي من خلال الضوء المرئي.',
    imagePath: 'assets/img/venus.gif',
  ),
  Planet(
    name: 'الأرض',
    description:
        'الأرض هي الكوكب الثالث من الشمس والكوكب الوحيد المعروف بوجود حياة عليه. يتميز كوكب الأرض بتنوع بيئي كبير، وغلاف جوي غني بالأكسجين، ووجود الماء السائل على سطحه، مما يتيح دعم الحياة بأشكالها المختلفة. تغطي المحيطات حوالي 70٪ من سطح الأرض، وتحتوي القارات على مناظر طبيعية متنوعة من الجبال إلى الصحارى والغابات.',
    imagePath: 'assets/img/earth.gif',
  ),
  Planet(
    name: 'القمر',
    description:
        'القمر هو التابع الطبيعي الوحيد للأرض ويعد أكبر قمر نسبيًا بالنسبة لحجم الكوكب الأم في النظام الشمسي. يتميز القمر بتأثيره الكبير على الأرض، حيث يسبب ظاهرة المد والجزر. سطح القمر مليء بالفوهات والتضاريس الجبلية، ويُعتقد أنه تكون بعد اصطدام كوكب بحجم المريخ بالأرض في بدايات النظام الشمسي.',
    imagePath: 'assets/img/lune.gif',
  ),
  Planet(
    name: 'المريخ',
    description:
        'المريخ، المعروف باسم الكوكب الأحمر، يتميز بسطح تغطيه الرمال والغبار الغنيين بأكسيد الحديد. يحتوي المريخ على أكبر بركان في النظام الشمسي، وهو أوليمبوس مونس، ووادٍ ضخم يدعى فاليس مارينيريس. هناك اهتمام علمي كبير بالمريخ بسبب احتمالية وجود مياه تحت سطحه، ما يجعله هدفًا رئيسيًا لاستكشافات الفضاء المستقبلية.',
    imagePath: 'assets/img/mars.gif',
  ),
  Planet(
    name: 'المشتري',
    description:
        'المشتري هو أكبر كوكب في النظام الشمسي، ويتميز بحجمه الهائل وبقعته الحمراء العملاقة، التي هي عبارة عن عاصفة ضخمة مستمرة منذ مئات السنين. يحيط بالمشتري أكثر من 79 قمراً، بما في ذلك غانيميد، الذي يعد أكبر قمر في النظام الشمسي. يتميز المشتري أيضًا بحلقات باهتة مصنوعة من الغبار والجليد.',
    imagePath: 'assets/img/jupiter.gif',
  ),
  Planet(
    name: 'زحل',
    description:
        'زحل هو الكوكب السادس من حيث البعد عن الشمس ويشتهر بحلقاته الرائعة، التي تتكون من جليد وصخور وغبار. زحل هو ثاني أكبر كوكب في النظام الشمسي وله العديد من الأقمار، من بينها تيتان، الذي يحتوي على بحيرات من الميثان السائل، ما يجعله فريدًا ومثيرًا للاهتمام.',
    imagePath: 'assets/img/saturn.gif',
  ),
  Planet(
    name: 'أورانوس',
    description:
        'أورانوس يتميز بميله المحوري الفريد، حيث يدور حول الشمس على جانبه، مما يجعله يظهر وكأنه يتدحرج في مداره. يتمتع بغلاف جوي يحتوي على غازات الهيدروجين والهيليوم والميثان، وهو المسؤول عن لونه الأزرق الفاتح. أورانوس هو أول كوكب تم اكتشافه باستخدام التلسكوب.',
    imagePath: 'assets/img/uranus.gif',
  ),
  Planet(
    name: 'نبتون',
    description:
        'نبتون هو الكوكب الأبعد في النظام الشمسي، ويتميز بلونه الأزرق العميق بسبب وجود الميثان في غلافه الجوي. يُعرف بوجود أعاصير ورياح قوية تصل سرعتها إلى 2100 كم/ساعة. نبتون لديه حلقات باهتة وعدد من الأقمار، أبرزها تريتون، الذي يُعتقد أنه كان كوكبًا قزمًا تم أسره بواسطة جاذبية نبتون.',
    imagePath: 'assets/img/neptune.gif',
  ),
  Planet(
    name: 'بلوتو',
    description:
        'بلوتو هو كوكب قزم يقع في منطقة حزام كايبر، ويتميز بحجمه الصغير ومداره البيضاوي غير المنتظم الذي يقطع مدار نبتون في بعض الأحيان. يحتوي سطحه على مناطق جليدية كبيرة، وبعض الجبال الجليدية. تم إلغاء تصنيفه ككوكب رسمي في عام 2006، ولكنه لا يزال محل اهتمام ودراسة كبيرة.',
    imagePath: 'assets/img/pluton.gif',
  ),
];
